* Python

This hides message when opening an Ipython repl

#+BEGIN_SRC emacs-lisp
(setq python-shell-unbuffered nil)
(setq python-shell-prompt-detect-failure-warning nil)
(setq python-shell-prompt-detect-enabled nil)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-hook! python-mode
  (setq +python-ipython-command '("ipython3" "-i" "--simple-prompt" "--no-color-info"))
  (lambda () (when (file-remote-p default-directory) (company-mode -1)))
  (lambda () (when (file-remote-p default-directory) (projectile-mode -1)))
  )

(defun +mike/open-ipython-repl ()
  "Open an IPython REPL."
  (interactive)
  (require 'python)
  (let ((python-shell-interpreter
         (or (car +python-ipython-command)
             "ipython"))
        (python-shell-interpreter-args
         (string-join (cdr +python-ipython-command) " ")))
    (+python/open-repl)))


#+END_SRC

#+RESULTS:
| (lambda (&rest _) (setq +python-ipython-command '(ipython3 -i --simple-prompt --no-color-info)) (lambda nil (when (file-remote-p default-directory) (company-mode -1))) (lambda nil (when (file-remote-p default-directory) (projectile-mode -1)))) | er/add-python-mode-expansions | doom-modeline-env-setup-python | (lambda nil (local-set-key (kbd <C-return>) 'eir-eval-in-python)) | doom--setq-tab-width-for-python-mode-h | +python-use-correct-flycheck-executables-h | evil-collection-python-set-evil-shift-width | (lambda (&rest _) (setq +python-ipython-command '(ipython3 -i --simple-prompt --no-color-info)) #'(lambda nil (if (file-remote-p default-directory) (progn (company-mode -1)))) #'(lambda nil (if (file-remote-p default-directory) (progn (projectile-mode -1))))) | pipenv-mode |

** General
#+BEGIN_SRC emacs-lisp
(setenv "DICTIONARY" "en-custom")
(setenv "DICTPATH" "/Users/mikevink/Library/Spelling/")

(use-package! org
  :config
  (setq org-image-actual-width '(400)
        org-clock-persist 'history
        org-directory "/Users/mikevink/Dropbox/org"
        org-highlight-latex-and-related '(latex script entities)
        org-columns-default-format "%25ITEM %TODO %3PRIORITY %TAGS"
        ispell-dictionary "en-custom"
        org-startup-folded t
        )
  (setq org-startup-indented t
        ;; display-line-numbers-type nil
        ;; org-superstar-leading-bullet '('" ")
        org-superstar-headline-bullets-list '(" ") ;; no bullets, needs org-bullets package
        org-ellipsis "  " ;; folding symbol
        ;; org-pretty-entities t
        org-hide-emphasis-markers t
        ;; show actually italicized text instead of /italicized text/
        ;; org-fontify-whole-heading-line t
        ;; org-fontify-done-headline t
        org-fontify-quote-and-verse-blocks t)
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.0))
)

  ;; (setq org-agenda-files '("/Users/mikevink/Dropbox/org/daily/"))
(setq org-agenda-files (list "/Users/mikevink/Dropbox/org/daily/"))
#+END_SRC

#+RESULTS:
| /Users/mikevink/Dropbox/org/daily/ |

** fancy priorities

#+BEGIN_SRC emacs-lisp
 (use-package! org-fancy-priorities
; :ensure t
  :hook
  (org-mode . org-fancy-priorities-mode)
  :config
   (setq org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕")))
#+END_SRC

#+RESULTS:
| org-fancy-priorities-mode | er/add-org-mode-expansions | +lookup--init-org-mode-handlers-h | (closure (t) (&rest _) (add-hook 'before-save-hook 'org-encrypt-entries nil t)) | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | doom-disable-show-paren-mode-h | doom-disable-show-trailing-whitespace-h | +org-enable-auto-reformat-tables-h | +org-enable-auto-update-cookies-h | +org-make-last-point-visible-h | evil-org-mode | toc-org-enable | flyspell-mode | embrace-org-mode-hook | org-eldoc-load |

** rice

#+BEGIN_SRC emacs-lisp
;; (add-hook 'org-mode-hook
;;           '(lambda ()
;;              (variable-pitch-mode 1) ;; All fonts with variable pitch.
;;              (mapc
;;               (lambda (face) ;; Other fonts with fixed-pitch.
;;                 (set-face-attribute face nil :inherit 'fixed-pitch))
;;               (list 'org-code
;;                     'org-link
;;                     'org-block
;;                     'org-table
;;                     'org-verbatim
;;                     'org-block-begin-line
;;                     'org-block-end-line
;;                     'org-meta-line
;;                     'org-document-info-keyword
;;                     'org-hide))))

(after! org
  (setq org-startup-indented t
     ;; display-line-numbers-type nil
     ;; org-superstar-leading-bullet '('" ")
      org-superstar-headline-bullets-list '(" ") ;; no bullets, needs org-bullets package
      org-ellipsis "  " ;; folding symbol
      ;; org-pretty-entities t
      org-hide-emphasis-markers t
      ;; show actually italicized text instead of /italicized text/
      ;; org-fontify-whole-heading-line t
      ;; org-fontify-done-headline t
      org-fontify-quote-and-verse-blocks t)
  )
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.2))
;; ;; (setq doom-theme 'doom-city-lights)

;; ;; ;; (setq org-format-latex-options :foreground default :background default :scale 1.5 :html-foreground "Black" :html-background "Transparent" :html-scale 1.0 :matchers
;; ;; ;; ("begin" "$1" "$" "$$" "\\(" "\\["))
#+END_SRC

#+RESULTS:
| :foreground | default | :background | default | :scale | 1.2 | :html-foreground | Black | :html-background | Transparent | :html-scale | 1.0 | :matchers | (begin $1 $ $$ \( \[) |

** ORB: org-roam-bibtex

#+BEGIN_SRC emacs-lisp
;; (use-package! org-roam-bibtex
;;   :load-path "~/Dropbox/bibliography/references.bib" ;Modify with your own path
;;   :hook (org-roam-mode . org-roam-bibtex-mode)
;;   :bind (:map org-mode-map
;;          (("C-c n a" . orb-note-actions))))

;; If you installed via MELPA
(use-package! org-roam-bibtex
  :after org-roam
  :hook (org-roam-mode . org-roam-bibtex-mode))

;; (setq orb-templates
;;       '(("r" "ref" plain (function org-roam-capture--get-point) ""
;;          :file-name "${citekey}"
;;          :head "#+TITLE: ${citekey}: ${title}\n#+ROAM_KEY: ${ref}\n" ; <--
;;          :unnarrowed t)))
;; (setq orb-preformat-keywords   '(("citekey" . "=key=") "title" "url" "file" "author-or-editor" "keywords"))



;; (setq orb-templates
;;       '(("n" "ref+noter" plain (function org-roam-capture--get-point)
;;          ""
;;          :file-name "${slug}"
;;          :head "#+TITLE: ${citekey}: ${title}\n#+ROAM_KEY: ${ref}\n#+ROAM_TAGS:

;; - keywords :: ${keywords}
;; \* ${title}
;; :PROPERTIES:
;; :Custom_ID: ${citekey}
;; :URL: ${url}
;; :AUTHOR: ${author-or-editor}
;; :NOTER_DOCUMENT: %(orb-process-file-field \"${citekey}\")
;; :NOTER_PAGE:
;; :END:")))

(setq orb-preformat-keywords
      '("citekey" "title" "url" "author-or-editor" "keywords" "file")
      orb-process-file-keyword t
      orb-file-field-extensions '("pdf"))

(setq orb-templates
      '(("r" "ref" plain (function org-roam-capture--get-point)
         ""
         :file-name "${citekey}"
         :head "#+TITLE: ${citekey}: ${title}\n#+ROAM_KEY: ${ref}

- keywords :: ${keywords}
\* ${title}
:PROPERTIES:
:Custom_ID: ${citekey}
:URL: ${url}
:AUTHOR: ${author-or-editor}
:NOTER_DOCUMENT: ${file}
:NOTER_PAGE:
:END:")))

#+END_SRC

#+RESULTS:
| r | ref | plain | #'org-roam-capture--get-point |   | :file-name | ${citekey} | :head | #+TITLE: ${citekey}: ${title} |

* Lsp

#+BEGIN_SRC emacs-lisp
(use-package! lsp
  :config
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-tramp-connection "pyls")
                    :major-modes '(python-mode)
                    :remote? t
                    :server-id 'pyls-remote))
  (setq dap-python-executable "/usr/bin/python3")
  :hook python-mode
  )



#+END_SRC

#+RESULTS:
| lsp | er/add-python-mode-expansions | doom-modeline-env-setup-python | (lambda nil (local-set-key (kbd <C-return>) 'eir-eval-in-python)) | doom--setq-tab-width-for-python-mode-h | +python-use-correct-flycheck-executables-h | evil-collection-python-set-evil-shift-width | (lambda (&rest _) (setq +python-ipython-command '(ipython3 -i --simple-prompt --no-color-info)) #'(lambda nil (if (file-remote-p default-directory) (progn (company-mode -1)))) #'(lambda nil (if (file-remote-p default-directory) (progn (projectile-mode -1))))) | pipenv-mode |

